### [데이터 필터링]
- 원하는 데이터를 추출하기 위해서 사용하는 방법
- 원하는 데이터 걸러내겠다는 의미
- 다양한 조건 검사가 진행됨 => 비교 검사 : 같다==,같지 않다!=,크다>,크거나 같다>=,작다<,작거나 같다 <=

(1) 모듈 로딩

In [1]:
import pandas as pd
import numpy as np

(2) 데이터 준비

In [2]:
file='../DATA/employees.csv'

(3) 데이터 저장

In [3]:
empDF=pd.read_csv(file)

(4) 데이터 확인 <hr>

(5) 데이터 필터링

In [4]:
'Happy'=='Happy','Happy'=='happy'

(True, False)

- [문제] 데이터에서 이름이 Maria인 데이터만 추출

In [5]:
print(empDF.columns,empDF.index,sep='\n\n')

Index(['First Name', 'Gender', 'Start Date', 'Salary', 'Mgmt', 'Team'], dtype='object')

RangeIndex(start=0, stop=1001, step=1)

- bool 값으로 구성된 데이터== 불링인덱싱(Booling Indexing)

In [6]:
(empDF['First Name']=='Maria').sum()  #=> 얘를 인덱스로 쓰겠다.....

6

In [7]:
mariaMask=(empDF['First Name']=='Maria')
type(mariaMask)

pandas.core.series.Series

In [8]:
empDF

     First Name  Gender Start Date    Salary   Mgmt          Team
0       Douglas    Male     8/6/93       NaN   True     Marketing
1        Thomas    Male    3/31/96   61933.0   True           NaN
2         Maria  Female        NaN  130590.0  False       Finance
3         Jerry     NaN     3/4/05  138705.0   True       Finance
4         Larry    Male    1/24/98  101004.0   True            IT
...         ...     ...        ...       ...    ...           ...
996     Phillip    Male    1/31/84   42392.0  False       Finance
997     Russell    Male    5/20/13   96914.0  False       Product
998       Larry    Male    4/20/13   60500.0  False  Business Dev
999      Albert    Male    5/15/12  129949.0   True         Sales
1000        NaN     NaN        NaN       NaN    NaN           NaN

[1001 rows x 6 columns]

In [9]:
empDF[mariaMask]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
198      Maria  Female   12/27/90   36067.0   True       Product
815      Maria     NaN    1/18/86  106562.0  False            HR
844      Maria     NaN    6/19/85  148857.0  False         Legal
936      Maria  Female    3/14/03   96250.0  False  Business Dev
984      Maria  Female   10/15/11   43455.0  False   Engineering

- [문제] 데이터에서 연봉이 100000이상인 데이터만 추출

In [10]:
s100000=(empDF["Salary"]>=100000)

In [11]:
empDF[s100000]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
3        Jerry     NaN     3/4/05  138705.0   True       Finance
4        Larry    Male    1/24/98  101004.0   True            IT
5       Dennis    Male    4/18/87  115163.0  False         Legal
9      Frances  Female     8/8/02  139852.0   True  Business Dev
..         ...     ...        ...       ...    ...           ...
990      Robin  Female    7/24/87  100765.0   True            IT
991       Rose  Female    8/25/02  134505.0   True     Marketing
992    Anthony    Male   10/16/11  112769.0   True       Finance
995      Henry     NaN   11/23/14  132483.0  False  Distribution
999     Albert    Male    5/15/12  129949.0   True         Sales

[409 rows x 6 columns]

- [문제] 데이터에서  성별이 남자이면서 연봉이 148000이상인 데이터만 추출

In [12]:
empDF["Gender"]=="Male"
empDF["Salary"]>=148000

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

- 여러 개의 조건이 모두 True 여야만 하는 조건 => AND 조건
  * 문법 : 조건1 & 조건2& 조건3& ...& 조건 N
  * 연산자: & 앰퍼센트
  * 결과: True/False

In [13]:
mask=((empDF["Gender"]=="Male")  & (empDF["Salary"]>=148000))
type(mask),mask.sum()

(pandas.core.series.Series, 5)

In [14]:
empDF[mask]

    First Name Gender Start Date    Salary   Mgmt     Team
83       Shawn   Male    9/23/05  148115.0   True  Finance
318        Roy   Male     8/6/06  148225.0  False  Finance
800   Clarence   Male     8/5/89  148941.0  False  Product
850    Charles   Male     9/3/97  148291.0  False      NaN
981      James   Male    1/15/93  148985.0  False    Legal

- 여러 개의 조건중 한 개 이상이  True 면 되는 조건 => OR 조건
  * 문법 : 조건1 | 조건2| 조건3| ...| 조건 N
  * 연산자: | 파이프  ==> 키보드 Enter키 위에 있음
  * 결과: True/False

- [문제] employees 데이터에서 입사일이 1993년 1월 1일 이전이거나 또는 팀이 없는 데이터 조회

In [15]:
mask2=((empDF["Start Date"]<'1993-01-01') | (empDF["Mgmt"]==False) )

In [16]:
empDF[mask2]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
4        Larry    Male    1/24/98  101004.0   True            IT
5       Dennis    Male    4/18/87  115163.0  False         Legal
8       Angela  Female   11/22/05   95570.0   True   Engineering
11       Julie  Female   10/26/97  102508.0   True         Legal
..         ...     ...        ...       ...    ...           ...
992    Anthony    Male   10/16/11  112769.0   True       Finance
995      Henry     NaN   11/23/14  132483.0  False  Distribution
996    Phillip    Male    1/31/84   42392.0  False       Finance
997    Russell    Male    5/20/13   96914.0  False       Product
998      Larry    Male    4/20/13   60500.0  False  Business Dev

[640 rows x 6 columns]

In [17]:
# 타입이 안 맞는다....

In [27]:
empDF['Start Date']=pd.to_datetime(empDF['Start Date'])

C:\Users\kdp\AppData\Local\Temp\ipykernel_5012\400972133.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  empDF['Start Date']=pd.to_datetime(empDF['Start Date'])

In [29]:
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 47.0+ KB

In [30]:
(empDF['Team'] =='Sales') | (empDF['Team'] =='Legal') | (empDF['Team'] =='marketing')

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999      True
1000    False
Name: Team, Length: 1001, dtype: bool

In [31]:
empDF['Team'].isin(['Sales','Legal','marketing'])

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999      True
1000    False
Name: Team, Length: 1001, dtype: bool

- 구간 지정 검사 불링 메서드 => DF.between(low,high)

In [33]:
(empDF['Salary']>=80000) & (empDF['Salary'] <90000)

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

In [35]:
empDF['Salary'].between(80000,90000)

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

In [36]:
empDF['First Name'].str.upper(),empDF['First Name'].str.lower()

(0       DOUGLAS
 1        THOMAS
 2         MARIA
 3         JERRY
 4         LARRY
          ...
 996     PHILLIP
 997     RUSSELL
 998       LARRY
 999      ALBERT
 1000        NaN
 Name: First Name, Length: 1001, dtype: object,
 0       douglas
 1        thomas
 2         maria
 3         jerry
 4         larry
          ...
 996     phillip
 997     russell
 998       larry
 999      albert
 1000        NaN
 Name: First Name, Length: 1001, dtype: object)